[Killed] BlockStatement
main/pages/Auth/PromptSignInPage.jsx:7:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import SignInContent from "main/pages/Auth/SignInContent.jsx";
 
-export default function PromptSignInPage() {
-  const location = useLocation();
-
-  const setRedirect = () => {
-    sessionStorage.setItem("redirect", location.pathname);
-  };
-
-  return (
-    <BasicLayout>
-      <Row className="p-3">
-        <Alert variant="danger">
-          Please sign in before accessing this page.
-        </Alert>
-      </Row>
-      <SignInContent onCardClick={setRedirect} />
-    </BasicLayout>
-  );
-}
+export default function PromptSignInPage() {}
 
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
