[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:172:24
 
             <span
               title="CSV Upload format Help"
-              onClick={() => window.open("/help/csv", "_blank")}
+              onClick={() => undefined}
               style={{ cursor: "pointer" }}
             >
killedBy: EnrollmentTabComponent Tests Upload CSV Roster help icon opens /help/csv in a new tab
statusReason: expected "spy" to be called with arguments: [ '/help/csv', '_blank' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:172:42
 
             <span
               title="CSV Upload format Help"
-              onClick={() => window.open("/help/csv", "_blank")}
+              onClick={() => window.open("", "_blank")}
               style={{ cursor: "pointer" }}
             >
killedBy: EnrollmentTabComponent Tests Upload CSV Roster help icon opens /help/csv in a new tab
statusReason: expected "spy" to be called with arguments: [ '/help/csv', '_blank' ]

Received: 

  1st spy call:

  [
-   "/help/csv",
