[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:28:18
     <Row
       xs={1}
       md={2}
-      className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
+      className={""}
       data-testid={"SignInPage-cardDisplay"}
     >
killedBy: SignInPage Tests Base environment test
statusReason: expect(element).toHaveClass("g-5 justify-content-center align-items-center d-flex gap-5")

Expected the element to have class:
  g-5 justify-content-center align-items-center d-flex gap-5
Received:
  row row-cols-md-2 row-cols-1

[Killed] LogicalOperator
main/pages/Auth/SignInContent.jsx:50:8
           onClick={onCardClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onCardClick}
-        />
-      )}
+      {systemInfo.activeDirectoryUrl || <SignInCard Icon={microsoftIcon} title={"Sign in with Microsoft"} description={<>
+              If you have credentials with these schools, sign in with Microsoft
+              <ul>
+                {loginProviderSchools.microsoft.map((school, index) => <li key={index}>{school}</li>)}
+              </ul>
+            </>} url={systemInfo.activeDirectoryUrl} testid={"microsoft"} onClick={onCardClick} />}
     </Row>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Found multiple elements with the role "img"

Here are the matching elements:

Ignored nodes: comments, script, style
<svg
  enable-background="new 0 0 48 48"
  fill="currentColor"

[Killed] ConditionalExpression
main/pages/Auth/SignInContent.jsx:50:8
           onClick={onCardClick}
         />
       )}
-      {systemInfo.activeDirectoryUrl && (
-        <SignInCard
-          Icon={microsoftIcon}
-          title={"Sign in with Microsoft"}
-          description={
-            <>
-              If you have credentials with these schools, sign in with Microsoft
-              <ul>
-                {loginProviderSchools.microsoft.map((school, index) => (
-                  <li key={index}>{school}</li>
-                ))}
-              </ul>
-            </>
-          }
-          url={systemInfo.activeDirectoryUrl}
-          testid={"microsoft"}
-          onClick={onCardClick}
-        />
-      )}
+      {true}
     </Row>
   );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
