[Killed] BlockStatement
main/components/Teams/TeamMemberForm.jsx:22:30
   } = useForm({ defaultValues: initialContents || {} });
   // Stryker restore all
 
-  const onSubmit = (data) => {
-    if (!data.rosterStudentId) {
-      setError("rosterStudentId", { message: "Please select a student" });
-      return;
-    }
-    submitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   const navigate = useNavigate();
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/Teams/TeamMemberForm.jsx:23:9
   // Stryker restore all
 
   const onSubmit = (data) => {
-    if (!data.rosterStudentId) {
+    if (false) {
       setError("rosterStudentId", { message: "Please select a student" });
       return;
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Please select a student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/Teams/TeamMemberForm.jsx:23:32
   // Stryker restore all
 
   const onSubmit = (data) => {
-    if (!data.rosterStudentId) {
-      setError("rosterStudentId", { message: "Please select a student" });
-      return;
-    }
+    if (!data.rosterStudentId) {}
     submitAction(data);
   };
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Please select a student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Teams/TeamMemberForm.jsx:24:35
 
   const onSubmit = (data) => {
     if (!data.rosterStudentId) {
-      setError("rosterStudentId", { message: "Please select a student" });
+      setError("rosterStudentId", {});
       return;
     }
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Please select a student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Teams/TeamMemberForm.jsx:43:10
           setValue={setValue}
           isInvalid={Boolean(errors.rosterStudentId)}
         />
-        {errors.rosterStudentId && (
-          <Form.Control.Feedback type="invalid">
-            {errors.rosterStudentId.message}
-          </Form.Control.Feedback>
-        )}
+        {true}
       </Form.Group>
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: TeamMemberForm tests displays error message when no student is selected
statusReason: Unable to find an element with the text: /Please select a student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
