[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:21:58
   courseId,
   testIdPrefix = "TeamsTable",
 }) {
-  const [postMemberModal, setPostMemberModal] = useState(false);
+  const [postMemberModal, setPostMemberModal] = useState(true);
   const [selectedTeam, setSelectedTeam] = useState(null);
   const [errorPostMemberModal, setErrorPostMemberModal] = useState(false);
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: useNavigate() may be used only in the context of a <Router> component.

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:23:68
 }) {
   const [postMemberModal, setPostMemberModal] = useState(false);
   const [selectedTeam, setSelectedTeam] = useState(null);
-  const [errorPostMemberModal, setErrorPostMemberModal] = useState(false);
+  const [errorPostMemberModal, setErrorPostMemberModal] = useState(true);
 
   const { data: rosterStudents } = useBackend(
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:32:40
     [],
     true,
   );
-  const onSuccessMember = (modalFn) => {
-    toast("Member added successfully");
-    modalFn(false);
-  };
+  const onSuccessMember = (modalFn) => {};
 
   const onDeleteMember = () => {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Member added successfully' ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:34:13
   );
   const onSuccessMember = (modalFn) => {
     toast("Member added successfully");
-    modalFn(false);
+    modalFn(true);
   };
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:37:32
     modalFn(false);
   };
 
-  const onDeleteMember = () => {
-    toast("Member removed successfully");
-  };
+  const onDeleteMember = () => {};
 
   const onDeleteTeam = () => {
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Member removed successfully' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:38:11
   };
 
   const onDeleteMember = () => {
-    toast("Member removed successfully");
+    toast("");
   };
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Member removed successfully' ]

Received: 

  1st spy call:

  [
-   "Member removed successfully",

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:41:30
     toast("Member removed successfully");
   };
 
-  const onDeleteTeam = () => {
-    toast("Team removed successfully");
-  };
+  const onDeleteTeam = () => {};
 
   const cellToAxiosParamsPost = (data) => ({
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Team removed successfully' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:42:11
   };
 
   const onDeleteTeam = () => {
-    toast("Team removed successfully");
+    toast("");
   };
 
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Team removed successfully' ]

Received: 

  1st spy call:

  [
-   "Team removed successfully",

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:45:33
     toast("Team removed successfully");
   };
 
-  const cellToAxiosParamsPost = (data) => ({
-    url: `/api/teams/addMember`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      teamId: selectedTeam.id,
-      rosterStudentId: data.rosterStudentId,
-    },
-  });
+  const cellToAxiosParamsPost = () => undefined;
 
   const cellToAxiosParamDeleteTeam = (team) => ({
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:55:38
     },
   });
 
-  const cellToAxiosParamDeleteTeam = (team) => ({
-    method: "DELETE",
-    url: `/api/teams`,
-    params: { id: team.id, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteTeam = () => undefined;
 
   const cellToAxiosParamDeleteMember = (member) => ({
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:55:49
     },
   });
 
-  const cellToAxiosParamDeleteTeam = (team) => ({
-    method: "DELETE",
-    url: `/api/teams`,
-    params: { id: team.id, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteTeam = (team) => ({});
 
   const cellToAxiosParamDeleteMember = (member) => ({
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:57:10
 
   const cellToAxiosParamDeleteTeam = (team) => ({
     method: "DELETE",
-    url: `/api/teams`,
+    url: ``,
     params: { id: team.id, courseId: courseId },
   });
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected '' to be '/api/teams' // Object.is equality

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:61:40
     params: { id: team.id, courseId: courseId },
   });
 
-  const cellToAxiosParamDeleteMember = (member) => ({
-    method: "DELETE",
-    url: `/api/teams/removeMember`,
-    params: { teamMemberId: member.id, courseId: courseId },
-  });
+  const cellToAxiosParamDeleteMember = () => undefined;
 
   const deleteTeamMutation = useBackendMutation(
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:64:13
   const cellToAxiosParamDeleteMember = (member) => ({
     method: "DELETE",
     url: `/api/teams/removeMember`,
-    params: { teamMemberId: member.id, courseId: courseId },
+    params: {},
   });
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected {} to deeply equal { teamMemberId: 4, courseId: '12' }

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:70:6
   const deleteTeamMutation = useBackendMutation(
     cellToAxiosParamDeleteTeam,
     { onSuccess: onDeleteTeam },
-    [`/api/teams/all?courseId=${courseId}`],
+    [``],
   );
 
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received: 

  1st invalidateQueries call:

  [
    {

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:76:6
   const deleteMemberMutation = useBackendMutation(
     cellToAxiosParamDeleteMember,
     { onSuccess: onDeleteMember },
-    [`/api/teams/all?courseId=${courseId}`],
+    [``],
   );
 
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received: 

  1st invalidateQueries call:

  [
    {

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:82:18
   const memberPostMutation = useBackendMutation(
     cellToAxiosParamsPost,
     {
-      onSuccess: () => onSuccessMember(setPostMemberModal),
+      onSuccess: () => undefined,
       onError: (error) => {
         setPostMemberModal(false);
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected "spy" to be called with arguments: [ 'Member added successfully' ]

Number of calls: 0

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:83:27
     cellToAxiosParamsPost,
     {
       onSuccess: () => onSuccessMember(setPostMemberModal),
-      onError: (error) => {
-        setPostMemberModal(false);
-        if (error.response.status === 409) {
-          setErrorPostMemberModal({
-            message: `This member is already in this team.`,
-          });
-        } else {
-          setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
-          });
-        }
-      },
+      onError: (error) => {},
     },
     [`/api/teams/all?courseId=${courseId}`],
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:84:28
     {
       onSuccess: () => onSuccessMember(setPostMemberModal),
       onError: (error) => {
-        setPostMemberModal(false);
+        setPostMemberModal(true);
         if (error.response.status === 409) {
           setErrorPostMemberModal({
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] EqualityOperator
main/components/Teams/TeamsTable.jsx:85:13
       onSuccess: () => onSuccessMember(setPostMemberModal),
       onError: (error) => {
         setPostMemberModal(false);
-        if (error.response.status === 409) {
+        if (error.response.status !== 409) {
           setErrorPostMemberModal({
             message: `This member is already in this team.`,
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This member is already in this team.
Received:
  Error Creating Member 409 error occurred while adding member to the team.

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:85:13
       onSuccess: () => onSuccessMember(setPostMemberModal),
       onError: (error) => {
         setPostMemberModal(false);
-        if (error.response.status === 409) {
+        if (true) {
           setErrorPostMemberModal({
             message: `This member is already in this team.`,
killedBy: TeamsTable tests add member returns generic error modal an unexpected error occurs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while adding member to the team.
Received:
  Error Creating Member This member is already in this team.

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:86:35
       onError: (error) => {
         setPostMemberModal(false);
         if (error.response.status === 409) {
-          setErrorPostMemberModal({
-            message: `This member is already in this team.`,
-          });
+          setErrorPostMemberModal({});
         } else {
           setErrorPostMemberModal({
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This member is already in this team.
Received:
  Error Creating Member

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:89:16
           setErrorPostMemberModal({
             message: `This member is already in this team.`,
           });
-        } else {
-          setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
-          });
-        }
+        } else {}
       },
     },
killedBy: TeamsTable tests add member returns generic error modal an unexpected error occurs
statusReason: Unable to find an element by: [data-testid="TeamsTable-error-post-member-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:91:22
           });
         } else {
           setErrorPostMemberModal({
-            message: `${JSON.stringify(error.status)} error occurred while adding member to the team.`,
+            message: ``,
           });
         }
killedBy: TeamsTable tests add member returns generic error modal an unexpected error occurs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while adding member to the team.
Received:
  Error Creating Member

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:99:38
     [`/api/teams/all?courseId=${courseId}`],
   );
 
-  const handlePostSubmit = (data) => {
-    memberPostMutation.mutate(data);
-  };
+  const handlePostSubmit = (data) => {};
 
   const deleteTeamCallback = async (team) => {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:103:46
     memberPostMutation.mutate(data);
   };
 
-  const deleteTeamCallback = async (team) => {
-    deleteTeamMutation.mutate(team);
-  };
+  const deleteTeamCallback = async (team) => {};
 
   const deleteMemberCallback = async (cell) => {
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:107:48
     deleteTeamMutation.mutate(team);
   };
 
-  const deleteMemberCallback = async (cell) => {
-    const member = cell.row.original;
-    deleteMemberMutation.mutate(member);
-  };
+  const deleteMemberCallback = async (cell) => {};
 
   const memberColumns = [
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:112:25
     deleteMemberMutation.mutate(member);
   };
 
-  const memberColumns = [
-    {
-      Header: "Roster Student ID",
-      accessor: "rosterStudent.id",
-    },
-    {
-      Header: "First Name",
-      accessor: "rosterStudent.firstName",
-    },
-    {
-      Header: "Last Name",
-      accessor: "rosterStudent.lastName",
-    },
-    {
-      Header: "Email",
-      accessor: "rosterStudent.email",
-    },
-    {
-      Header: "GitHub Login",
-      accessor: "rosterStudent.githubLogin",
-    },
-  ];
+  const memberColumns = [];
 
   return (
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:115:17
   const memberColumns = [
     {
       Header: "Roster Student ID",
-      accessor: "rosterStudent.id",
+      accessor: "",
     },
     {
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] ObjectLiteral
main/components/Teams/TeamsTable.jsx:117:5
       Header: "Roster Student ID",
       accessor: "rosterStudent.id",
     },
-    {
-      Header: "First Name",
-      accessor: "rosterStudent.firstName",
-    },
+    {},
     {
       Header: "Last Name",
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:123:17
     },
     {
       Header: "Last Name",
-      accessor: "rosterStudent.lastName",
+      accessor: "",
     },
     {
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.lastName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:127:17
     },
     {
       Header: "Email",
-      accessor: "rosterStudent.email",
+      accessor: "",
     },
     {
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:131:17
     },
     {
       Header: "GitHub Login",
-      accessor: "rosterStudent.githubLogin",
+      accessor: "",
     },
   ];
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.githubLogin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:139:23
     <>
       <Modal
         show={postMemberModal}
-        onHide={() => {
-          setPostMemberModal(false);
-          setSelectedTeam(null);
-        }}
+        onHide={() => {}}
         centered={true}
         data-testid={`${testIdPrefix}-post-modal`}
killedBy: TeamsTable tests modal closes when onHide is triggered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:140:30
       <Modal
         show={postMemberModal}
         onHide={() => {
-          setPostMemberModal(false);
+          setPostMemberModal(true);
           setSelectedTeam(null);
         }}
killedBy: TeamsTable tests modal closes when onHide is triggered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:143:19
           setPostMemberModal(false);
           setSelectedTeam(null);
         }}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-post-modal`}
       >
killedBy: TeamsTable tests TeamsForm submit works and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ArrowFunction
main/components/Teams/TeamsTable.jsx:156:17
       </Modal>
       <Modal
         show={errorPostMemberModal}
-        onHide={() => setErrorPostMemberModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-member-modal`}
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-error-post-member-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:156:47
       </Modal>
       <Modal
         show={errorPostMemberModal}
-        onHide={() => setErrorPostMemberModal(false)}
+        onHide={() => setErrorPostMemberModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-member-modal`}
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TeamsTable-error-post-member-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:157:19
       <Modal
         show={errorPostMemberModal}
         onHide={() => setErrorPostMemberModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-error-post-member-modal`}
       >
killedBy: TeamsTable tests add member returns 409 error modal when member is already in the team
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:174:18
                   {team.name}
                 </h3>
 
-                {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
-                  <span className="ms-auto me-3">
-                    <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
-                      className="me-3"
-                    >
-                      Add Team Member
-                    </Button>
-                    <Button
-                      variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
-                    >
-                      Delete
-                    </Button>
-                  </span>
-                )}
+                {true}
               </span>
             </Accordion.Header>
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] ConditionalExpression
main/components/Teams/TeamsTable.jsx:174:18
                   {team.name}
                 </h3>
 
-                {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
-                  <span className="ms-auto me-3">
-                    <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
-                      className="me-3"
-                    >
-                      Add Team Member
-                    </Button>
-                    <Button
-                      variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
-                      data-testid={`${testIdPrefix}-${team.id}-delete-button`}
-                    >
-                      Delete
-                    </Button>
-                  </span>
-                )}
+                {false}
               </span>
             </Accordion.Header>
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:177:39
                 {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
                   <span className="ms-auto me-3">
                     <Button
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        setPostMemberModal(true);
-                        setSelectedTeam(team);
-                      }}
+                      onClick={(e) => {}}
                       data-testid={`${testIdPrefix}-${team.id}-add-member-button`}
                       className="me-3"
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] BooleanLiteral
main/components/Teams/TeamsTable.jsx:179:44
                     <Button
                       onClick={(e) => {
                         e.stopPropagation();
-                        setPostMemberModal(true);
+                        setPostMemberModal(false);
                         setSelectedTeam(team);
                       }}
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] BlockStatement
main/components/Teams/TeamsTable.jsx:189:39
                     </Button>
                     <Button
                       variant="danger"
-                      onClick={(e) => {
-                        e.stopPropagation();
-                        deleteTeamCallback(team);
-                      }}
+                      onClick={(e) => {}}
                       data-testid={`${testIdPrefix}-${team.id}-delete-button`}
                     >
killedBy: TeamsTable tests delete team calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/components/Teams/TeamsTable.jsx:204:26
             <Accordion.Body>
               <OurTable
                 data={team.teamMembers}
-                columns={[
-                  ...memberColumns,
-                  ...(hasRole(currentUser, "ROLE_INSTRUCTOR")
-                    ? [
-                        ButtonColumn(
-                          "Remove",
-                          "danger",
-                          deleteMemberCallback,
-                          `${testIdPrefix}-${team.id}`,
-                        ),
-                      ]
-                    : []),
-                ]}
+                columns={[]}
                 testid={`${testIdPrefix}-${team.id}-members-table`}
               />
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"

[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:206:44
                 data={team.teamMembers}
                 columns={[
                   ...memberColumns,
-                  ...(hasRole(currentUser, "ROLE_INSTRUCTOR")
+                  ...(hasRole(currentUser, "")
                     ? [
                         ButtonColumn(
killedBy: TeamsTable tests delete member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-cell-row-0-col-Remove-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"
