[Killed] StringLiteral
main/components/Teams/TeamsTable.jsx:217:25
                       ]
                     : []),
                 ]}
-                testid={`${testIdPrefix}-${team.id}-members-table`}
+                testid={``}
               />
             </Accordion.Body>
killedBy: TeamsTable tests table renders corretly when there are teams
statusReason: Unable to find an element by: [data-testid="TeamsTable-3-members-table-header-rosterStudent.firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="accordion"
      data-testid="TeamsTable-accordion"
