[Killed] BlockStatement
main/pages/Auth/PromptSignInPage.jsx:5:44
 import { useLocation } from "react-router";
 import SignInContent from "main/pages/Auth/SignInContent.jsx";
 
-export default function PromptSignInPage() {
-  const location = useLocation();
-
-  const setRedirect = () => {
-    sessionStorage.setItem("redirect", location.pathname);
-  };
-
-  return <SignInContent showPromptAlert={true} onCardClick={setRedirect} />;
-}
+export default function PromptSignInPage() {}
 
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/pages/Auth/PromptSignInPage.jsx:12:42
     sessionStorage.setItem("redirect", location.pathname);
   };
 
-  return <SignInContent showPromptAlert={true} onCardClick={setRedirect} />;
+  return <SignInContent showPromptAlert={false} onCardClick={setRedirect} />;
 }
 
killedBy: SignInPage Tests Base environment test
statusReason: Unable to find an element with the text: Please sign in before accessing this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
