[Survived] BooleanLiteral
main/pages/Auth/SignInContent.jsx:11:21
 import loginProviderSchools from "main/utils/loginProviderSchools";
 
 export default function SignInContent({
-  showPromptAlert = false,
+  showPromptAlert = true,
   onCardClick, // used by PromptSignInPage
 }) {

[Killed] ArrowFunction
main/pages/Auth/SignInContent.jsx:16:25
 }) {
   const { data: systemInfo } = useSystemInfo();
 
-  const microsoftIcon = () => (
-    <span data-testid={"SignInPage-microsoftIcon"}>
-      <FaMicrosoft size={"10em"} role={"img"} />
-    </span>
-  );
+  const microsoftIcon = () => undefined;
 
   const googleIcon = () => (
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:17:24
   const { data: systemInfo } = useSystemInfo();
 
   const microsoftIcon = () => (
-    <span data-testid={"SignInPage-microsoftIcon"}>
+    <span data-testid={""}>
       <FaMicrosoft size={"10em"} role={"img"} />
     </span>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:18:40
 
   const microsoftIcon = () => (
     <span data-testid={"SignInPage-microsoftIcon"}>
-      <FaMicrosoft size={"10em"} role={"img"} />
+      <FaMicrosoft size={"10em"} role={""} />
     </span>
   );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an accessible element with the role "img"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ArrowFunction
main/pages/Auth/SignInContent.jsx:22:22
     </span>
   );
 
-  const googleIcon = () => (
-    <span data-testid={"SignInPage-googleIcon"}>
-      <FcGoogle size={"10em"} role={"img"} />
-    </span>
-  );
+  const googleIcon = () => undefined;
 
   return (
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInPage-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:24:23
 
   const googleIcon = () => (
     <span data-testid={"SignInPage-googleIcon"}>
-      <FcGoogle size={"10em"} role={"img"} />
+      <FcGoogle size={""} role={"img"} />
     </span>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: expect(element).toHaveAttribute("height", "10em") // element.getAttribute("height") === "10em"

Expected the element to have attribute:
  height="10em"
Received:
  height="1em"

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:24:37
 
   const googleIcon = () => (
     <span data-testid={"SignInPage-googleIcon"}>
-      <FcGoogle size={"10em"} role={"img"} />
+      <FcGoogle size={"10em"} role={""} />
     </span>
   );
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an accessible element with the role "img"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] LogicalOperator
main/pages/Auth/SignInContent.jsx:30:8
 
   return (
     <BasicLayout>
-      {showPromptAlert && (
-        <Row className="p-3">
-          <Alert variant={"danger"}>
-            Please sign in before accessing this page.
-          </Alert>
-        </Row>
-      )}
+      {showPromptAlert || <Row className="p-3">
+          <Alert variant={"danger"}>
+            Please sign in before accessing this page.
+          </Alert>
+        </Row>}
       <Row
         xs={1}
killedBy: SignInPage Tests Base environment test
statusReason: Unable to find an element with the text: Please sign in before accessing this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInContent.jsx:30:8
 
   return (
     <BasicLayout>
-      {showPromptAlert && (
-        <Row className="p-3">
-          <Alert variant={"danger"}>
-            Please sign in before accessing this page.
-          </Alert>
-        </Row>
-      )}
+      {true}
       <Row
         xs={1}
killedBy: SignInPage Tests Base environment test
statusReason: Unable to find an element with the text: Please sign in before accessing this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInContent.jsx:43:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with Google
-                <ul>
-                  {loginProviderSchools.google.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-            onClick={onCardClick}
-          />
-        )}
+        {true}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Auth/SignInContent.jsx:43:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with Google
-                <ul>
-                  {loginProviderSchools.google.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-            onClick={onCardClick}
-          />
-        )}
+        {systemInfo.oauthLogin || <SignInCard Icon={googleIcon} title={"Sign in with Google"} description={<>
+                If you have credentials with these schools, sign in with Google
+                <ul>
+                  {loginProviderSchools.google.map((school, index) => <li key={index}>{school}</li>)}
+                </ul>
+              </>} url={systemInfo.oauthLogin} testid={"google"} onClick={onCardClick} />}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:58:21
               </>
             }
             url={systemInfo.oauthLogin}
-            testid={"google"}
+            testid={""}
             onClick={onCardClick}
           />
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInCard-base-google"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInContent.jsx:62:10
             onClick={onCardClick}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with
-                Microsoft
-                <ul>
-                  {loginProviderSchools.microsoft.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-            onClick={onCardClick}
-          />
-        )}
+        {false}
       </Row>
     </BasicLayout>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Auth/SignInContent.jsx:62:10
             onClick={onCardClick}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with
-                Microsoft
-                <ul>
-                  {loginProviderSchools.microsoft.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-            onClick={onCardClick}
-          />
-        )}
+        {true}
       </Row>
     </BasicLayout>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Auth/SignInContent.jsx:78:21
               </>
             }
             url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
+            testid={""}
             onClick={onCardClick}
           />
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInCard-base-microsoft"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
