[Killed] BlockStatement
main/components/RosterStudent/RosterStudentDropdown.jsx:8:4
   rosterStudents,
   setValue,
   isInvalid,
-}) {
-  const options = rosterStudents.map((student) => ({
-    id: student.id,
-    label: `${student.firstName} ${student.lastName}`,
-  }));
-
-  return (
-    <Typeahead
-      id="rosterStudentId"
-      inputProps={{ "data-testid": "RosterStudentDropdown" }}
-      options={options}
-      placeholder="Select a student..."
-      isInvalid={isInvalid}
-      onChange={(selected) => {
-        if (selected.length > 0) {
-          setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
-        } else {
-          setValue("rosterStudentId", "", { shouldValidate: true });
-        }
-      }}
-    />
-  );
-}
+}) {}
 
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentDropdown.jsx:9:38
   setValue,
   isInvalid,
 }) {
-  const options = rosterStudents.map((student) => ({
-    id: student.id,
-    label: `${student.firstName} ${student.lastName}`,
-  }));
+  const options = rosterStudents.map(() => undefined);
 
   return (
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:9:52
   setValue,
   isInvalid,
 }) {
-  const options = rosterStudents.map((student) => ({
-    id: student.id,
-    label: `${student.firstName} ${student.lastName}`,
-  }));
+  const options = rosterStudents.map((student) => ({}));
 
   return (
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Unable to find role="option" and name "Jon Snow"

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:17:19
   return (
     <Typeahead
       id="rosterStudentId"
-      inputProps={{ "data-testid": "RosterStudentDropdown" }}
+      inputProps={{}}
       options={options}
       placeholder="Select a student..."
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: Unable to find an element by: [data-testid="RosterStudentDropdown"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentDropdown.jsx:21:31
       options={options}
       placeholder="Select a student..."
       isInvalid={isInvalid}
-      onChange={(selected) => {
-        if (selected.length > 0) {
-          setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
-        } else {
-          setValue("rosterStudentId", "", { shouldValidate: true });
-        }
-      }}
+      onChange={(selected) => {}}
     />
   );
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentDropdown.jsx:22:13
       placeholder="Select a student..."
       isInvalid={isInvalid}
       onChange={(selected) => {
-        if (selected.length > 0) {
+        if (false) {
           setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
         } else {
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentDropdown.jsx:22:34
       placeholder="Select a student..."
       isInvalid={isInvalid}
       onChange={(selected) => {
-        if (selected.length > 0) {
-          setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
-        } else {
+        if (selected.length > 0) {} else {
           setValue("rosterStudentId", "", { shouldValidate: true });
         }
killedBy: RosterStudentDropdown tests that the dropdown renders correctly and handles selection
statusReason: expected "spy" to be called with arguments: [ 'rosterStudentId', 1, { …(1) } ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:23:73
       isInvalid={isInvalid}
       onChange={(selected) => {
         if (selected.length > 0) {
-          setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
+          setValue("rosterStudentId", selected[0].id, { shouldValidate: false });
         } else {
           setValue("rosterStudentId", "", { shouldValidate: true });
killedBy: RosterStudentDropdown tests that the dropdown renders correctly and handles selection
statusReason: expected "spy" to be called with arguments: [ 'rosterStudentId', 1, { …(1) } ]

Received: 

  1st spy call:

  [
    "rosterStudentId",

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:23:20
       isInvalid={isInvalid}
       onChange={(selected) => {
         if (selected.length > 0) {
-          setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
+          setValue("", selected[0].id, { shouldValidate: true });
         } else {
           setValue("rosterStudentId", "", { shouldValidate: true });
killedBy: TeamsTable tests add member calls correct API endpoint with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentDropdown.jsx:24:16
       onChange={(selected) => {
         if (selected.length > 0) {
           setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
-        } else {
-          setValue("rosterStudentId", "", { shouldValidate: true });
-        }
+        } else {}
       }}
     />
killedBy: RosterStudentDropdown tests that clearing the selection sets rosterStudentId to empty string
statusReason: expected "spy" to be called with arguments: [ 'rosterStudentId', '', { …(1) } ]

Received: 

  1st spy call:

  [
    "rosterStudentId",

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentDropdown.jsx:25:61
         if (selected.length > 0) {
           setValue("rosterStudentId", selected[0].id, { shouldValidate: true });
         } else {
-          setValue("rosterStudentId", "", { shouldValidate: true });
+          setValue("rosterStudentId", "", { shouldValidate: false });
         }
       }}
killedBy: RosterStudentDropdown tests that clearing the selection sets rosterStudentId to empty string
statusReason: expected "spy" to be called with arguments: [ 'rosterStudentId', '', { …(1) } ]

Received: 

  1st spy call:

  [
    "rosterStudentId",
