[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:75:28
           >
             <Link
               to={`/instructor/courses/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
+              data-testid={``}
             >
               {cell.row.original.courseName}
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:118:20
     },
     {
       header: "Students",
-      accessorKey: "numStudents",
+      accessorKey: "",
     },
     {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:137:12
   };
 
   const cellToAxiosParamsCourseEdit = (formData) => {
-    return {
-      url: `/api/courses`,
-      method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        courseName: formData.courseName,
-        term: formData.term,
-        school: formData.school,
-      },
-    };
+    return {};
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:177:16
   const onCourseUpdateError = (error) => {
     if (error.response.data.message)
       toast(`Was not able to update course:\n${error.response.data.message}`);
-    else toast(`Was not able to update course:\n${error.message}`);
+    else toast(``);
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Shows error toast when course update API call fails without message
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Was not able to update course:

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:181:11
   };
 
   const onDeleteSuccess = () => {
-    toast("Course deleted successfully");
+    toast("");
     setShowDeleteModal(false);
     setCourseToDelete(null);
killedBy: InstructorCoursesTable tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: Cannot read properties of undefined (reading 'onDelete')

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:186:36
     setCourseToDelete(null);
   };
 
-  const onDeleteError = (error) => {
-    if (error.response?.data?.message)
-      toast(`Could not delete course:\n${error.response.data.message}`);
-    else toast(`Could not delete course:\n${error.message}`);
-  };
+  const onDeleteError = (error) => {};
 
   const editMutation = useBackendMutation(
killedBy: InstructorCoursesTable tests Shows error toast when delete course API call fails with message
statusReason: Cannot read properties of undefined (reading 'onDelete')

[Killed] OptionalChaining
main/components/Courses/InstructorCoursesTable.jsx:187:9
   };
 
   const onDeleteError = (error) => {
-    if (error.response?.data?.message)
+    if (error.response.data?.message)
       toast(`Could not delete course:\n${error.response.data.message}`);
     else toast(`Could not delete course:\n${error.message}`);
killedBy: InstructorCoursesTable tests Shows error toast when delete course API call fails with message
statusReason: Cannot read properties of undefined (reading 'onDelete')

[Killed] OptionalChaining
main/components/Courses/InstructorCoursesTable.jsx:187:9
   };
 
   const onDeleteError = (error) => {
-    if (error.response?.data?.message)
+    if (error.response?.data.message)
       toast(`Could not delete course:\n${error.response.data.message}`);
     else toast(`Could not delete course:\n${error.message}`);
killedBy: InstructorCoursesTable tests Shows error toast when delete course API call fails with message
statusReason: Cannot read properties of undefined (reading 'onDelete')

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:188:13
 
   const onDeleteError = (error) => {
     if (error.response?.data?.message)
-      toast(`Could not delete course:\n${error.response.data.message}`);
+      toast(``);
     else toast(`Could not delete course:\n${error.message}`);
   };
killedBy: InstructorCoursesTable tests Shows error toast when delete course API call fails with message
statusReason: Cannot read properties of undefined (reading 'onDelete')

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:251:31
   };
 
   const canInstall = (row) => {
-    if (row.original.orgName) {
-      return false;
-    }
+    if (row.original.orgName) {}
     if (hasRole(currentUser, "ROLE_ADMIN")) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:283:15
   const columnsWithInstall = [
     ...columns,
     {
-      header: "GitHub Org",
+      header: "",
       id: "orgName",
       cell: ({ cell }) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: GitHub Org. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:284:11
     ...columns,
     {
       header: "GitHub Org",
-      id: "orgName",
+      id: "",
       cell: ({ cell }) => {
         const result = canInstall(cell.row);
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:310:22
         } else {
           return (
             <div
-              style={{
-                display: "flex",
-                justifyContent: "space-between",
-                width: "100%",
-              }}
+              style={{}}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
             >
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveAttribute("style", "display: flex; justify-content: space-between; width: 100%;") // element.getAttribute("style") === "display: flex; justify-content: space-between; width: 100%;"

Expected the element to have attribute:
  style="display: flex; justify-content: space-between; width: 100%;"
Received:
  null

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:315:28
                 justifyContent: "space-between",
                 width: "100%",
               }}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
+              data-testid={``}
             >
               <OverlayTrigger placement="right" overlay={renderTooltip(cell)}>
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-orgName-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:332:32
               <OverlayTrigger
                 placement="right"
                 overlay={
-                  <Tooltip id={`tooltip-geargithubicon-${cell.row.index}`}>
+                  <Tooltip id={``}>
                     Manage settings for association between your GitHub
                     organization and this web application.
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests expect the correct tooltip ID for the github icon (that redirects to github installation settings)
statusReason: expect(element).toHaveAttribute("id", "tooltip-geargithubicon-0") // element.getAttribute("id") === "tooltip-geargithubicon-0"

Expected the element to have attribute:
  id="tooltip-geargithubicon-0"
Received:
  id=""

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:361:46
       header: "Instructor",
       accessorKey: "instructorEmail",
       cell: ({ cell }) => {
-        const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
+        const isAdmin = hasRole(currentUser, "");
         if (isAdmin && enableInstructorUpdate) {
           return (
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Tests instructor email is clickable for admin users when enableInstructorUpdate selected
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-instructorEmail-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:362:48
       accessorKey: "instructorEmail",
       cell: ({ cell }) => {
         const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-        if (isAdmin && enableInstructorUpdate) {
-          return (
-            <Button
-              variant="link"
-              onClick={() => handleShowModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
-              style={{ padding: 0, textDecoration: "underline" }}
-            >
-              {cell.row.original.instructorEmail}
-            </Button>
-          );
-        } else {
+        if (isAdmin && enableInstructorUpdate) {} else {
           return cell.row.original.instructorEmail;
         }
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Tests instructor email is clickable for admin users when enableInstructorUpdate selected
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-instructorEmail-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:382:17
       ? [
           {
             header: "Delete",
-            id: "delete",
+            id: "",
             cell: ({ cell }) => {
               const canDelete =
killedBy: InstructorCoursesTable tests InstructorCourseTable delete course tests Delete column appears only when deleteCourseButton=true
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:388:19
                 cell.row.original.numStudents === 0 &&
                 cell.row.original.numStaff === 0;
 
-              if (!canDelete) {
+              if (true) {
                 return (
                   <OverlayTrigger
killedBy: InstructorCoursesTable tests InstructorCourseTable delete course tests Delete button is enabled only when course has no students or staff
statusReason: expected 4 to be 3 // Object.is equality

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:403:41
                         style={{
                           background: "#A0A0A0",
                           padding: "1px",
-                          borderRadius: "4px",
+                          borderRadius: "",
                         }}
                       >
killedBy: InstructorCoursesTable tests Clicking the enabled delete button calls the correct axios DELETE request
statusReason: Cannot read properties of undefined (reading 'onDelete')
