[Killed] BlockStatement
main/pages/Auth/SignInPage.jsx:4:38
 import React from "react";
 import SignInContent from "main/pages/Auth/SignInContent.jsx";
 
-export default function SignInPage() {
-  return <SignInContent />;
-}
+export default function SignInPage() {}
 
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
