[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:136:31
                 The following CSV format can be obtained from the Canvas system
                 at Chico State, through the "New Analytics" feature:
               </p>
-              <pre className={"csvExample"} data-testid="chicoStateCsvExample">
+              <pre className={""} data-testid="chicoStateCsvExample">
                 {csvFixtures.chicoStateCanvas}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:

[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:192:31
                 The following CSV format can be obtained for courses at Oregon
                 State University.
               </p>
-              <pre className={"csvExample"} data-testid="oregonStateCsvExample">
+              <pre className={""} data-testid="oregonStateCsvExample">
                 {csvFixtures.oregonStateCSV}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:
