[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:34:42
   }
   // Stryker restore all
 
-  function cellToAxiosParamsDelete(cell) {
-    console.log(cell);
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: cell.id,
-        courseId: cell.courseId,
-        removeFromOrg: cell.removeFromOrg,
-      },
-    };
-
-    // why is this a bad request?
-  }
+  function cellToAxiosParamsDelete(cell) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:36:12
 
   function cellToAxiosParamsDelete(cell) {
     console.log(cell);
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: cell.id,
-        courseId: cell.courseId,
-        removeFromOrg: cell.removeFromOrg,
-      },
-    };
+    return {};
 
     // why is this a bad request?
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:59:48
   );
   // Stryker restore all
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/coursestaff`,
-    method: "PUT",
-    // Stryker disable next-line ObjectLiteral
-    params: {
-      firstName: formData.firstName,
-      lastName: formData.lastName,
-      id: formData.id,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamsEdit = (formData) => ({});
 
   const hideModal = () => {
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Staff member updated successfully.",

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:60:10
   // Stryker restore all
 
   const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/coursestaff`,
+    url: ``,
     method: "PUT",
     // Stryker disable next-line ObjectLiteral
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Staff member updated successfully.",

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:86:38
     setDeleteCourseStaff(cell.row.original.id);
   };
 
-  const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      id: deleteCourseStaff,
-      courseId: courseId,
-      removeFromOrg: data.removeFromOrg,
-    });
-  };
+  const submitDeleteForm = (data) => {};
 
   const editMutation = useBackendMutation(
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:87:27
   };
 
   const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      id: deleteCourseStaff,
-      courseId: courseId,
-      removeFromOrg: data.removeFromOrg,
-    });
+    deleteMutation.mutate({});
   };
 
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected { id: undefined, …(2) } to deeply equal { id: 1, courseId: 7, …(1) }

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:232:31
   });
 
   if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("", "primary", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
