[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:35:42
   // Stryker restore all
 
 
-  function cellToAxiosParamsDelete(cell) {
-    console.log(cell);
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: cell.id,
-        courseId: cell.courseId,
-        removeFromOrg: cell.removeFromOrg
-      },
-    };
-
-    // why is this a bad request?
-  }
+  function cellToAxiosParamsDelete(cell) {}
 
   
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:41:15
       // Stryker disable next-line StringLiteral
       url: "/api/coursestaff/delete",
       method: "DELETE",
-      params: {
-        id: cell.id,
-        courseId: cell.courseId,
-        removeFromOrg: cell.removeFromOrg
-      },
+      params: {},
     };
 
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { id: 1, courseId: 7, …(1) }

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:88:38
     setDeleteCourseStaff(cell.row.original.id);  
   };
 
-  const submitDeleteForm = (data) => {
-    
-    deleteMutation.mutate({
-      id: deleteCourseStaff,
-      courseId: courseId,
-      removeFromOrg: data.removeFromOrg
-    });
-  };
+  const submitDeleteForm = (data) => {};
 
   const editMutation = useBackendMutation(
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:186:13
   };
 
   columns.push({
-    header: "Status",
+    header: "",
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"
